// Copyright (c) 2018 Kenji Iida  All rights reserved.
/*

    変数に関する問題

    VariablePracticeクラスのmainメソッドのコメントの
    指示通りに、プログラムを記述してください。
    下記、【実行結果】と同じ内容が出力されればOKです。

    【実行結果】
    りんごの価格：130円
    りんごの個数：6個
    りんごの総価格：780円

*/
public class VariablePractice{

    public static void main(String[] args){

        // りんごの価格を表現するint型の変数を宣言してください
        // (変数名はお任せします)

\
        // りんごの価格変数に130を代入してください


        // りんごの個数を表現するint型の変数を宣言し、
        // 初期値として6を代入してください（変数名はお任せします）


        // りんごの総価格を表現するint型の変数を宣言し、
        // 初期値にりんご価格変数の値×りんご個数変数の値の演算結果
        // を代入してください（変数名はお任せします）


        // りんご価格変数の値を出力してください


        // りんご個数変数の値を出力してください


        // りんご総価格変数の値を出力してください


    }

}
