// Copyright (c) 2018 Kenji Iida  All rights reserved.
/*

    for文と配列の標準問題

    100人分のテストの点数を格納しているint配列型の
    変数pointsがあります。
    この試験の平均点の算出と、ヒストグラムを作成してください。
    ヒストグラムは、階級ごとに個数を集計し、グラフ化した
    ものです。階級は、0点台（0〜9点）、10点台（10〜19点）、
    …90点台（90〜100点）とします。
    (100点の人を90点台に含めている点がポイントです)

    【実行結果】
    平均点：60.3
    ヒストグラム
     0点台*
    10点台**
    20点台******
    30点台**
    40点台**************
    50点台****************
    60点台****************************
    70点台*****************
    80点台**********
    90点台****

*/
public class ForArrayNormalPractice{

    public static void main(String[] args){

        // 100人分のテストの点数を格納した配列変数points
        int[] points = {
                        69,40,88,68,13,62,45,43,28,69,
                        54,77,81,34,41,78,59,21,45,64,
                        55,18,63,80,64,26,52,44,61,50,
                        44,82,56,74,67,98,58,84,77,70,
                        60,77,64,89,59,74,21,66,85,68,
                        90,48,64,80,63,47,70,79,51,66,
                        23,84,57,57,76,60,100,66,79,61,
                        47,66,76,45,90,69,72,51,86,64,
                        57,51,42,60,71,69,7,62,77,61,
                        43,50,68,30,78,58,40,62,70,22
                       };

        // ここからコーディングしてください

    }

}
